Revit 2027 API
BuiltInFailures.RebarCouplerFailures.NoBarSizeWarning Property
 This is used to post warning. At least Bar Size 1 or Bar Size 2 should have a value other than "None".
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoBarSizeWarning { get; }
Public Shared ReadOnly Property NoBarSizeWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoBarSizeWarning {
	FailureDefinitionId^ get ();
}
static member NoBarSizeWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace